In [1]:
# Atualizando o pandas
!pip install -U watermark

Requirement already satisfied: watermark in c:\users\padrao\anaconda3\lib\site-packages (2.4.2)
Requirement already satisfied: ipython>=6.0 in c:\users\padrao\anaconda3\lib\site-packages (from watermark) (7.31.1)
Requirement already satisfied: setuptools in c:\users\padrao\anaconda3\lib\site-packages (from watermark) (63.4.1)
Requirement already satisfied: importlib-metadata>=1.4 in c:\users\padrao\anaconda3\lib\site-packages (from watermark) (4.11.3)
Requirement already satisfied: py3nvml>=0.2 in c:\users\padrao\anaconda3\lib\site-packages (from watermark) (0.2.7)
Requirement already satisfied: zipp>=0.5 in c:\users\padrao\anaconda3\lib\site-packages (from importlib-metadata>=1.4->watermark) (3.8.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (3.0.20)
Requirement already satisfied: matplotlib-inline in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (0.1.6)
Requirement already satisfied: jedi>=0.16 in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (0.18.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (5.1.1)
Requirement already satisfied: colorama in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (0.4.5)
Requirement already satisfied: backcall in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (0.2.0)
Requirement already satisfied: decorator in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (5.1.1)
Requirement already satisfied: pygments in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (2.11.2)
Requirement already satisfied: pickleshare in c:\users\padrao\anaconda3\lib\site-packages (from ipython>=6.0->watermark) (0.7.5)
Requirement already satisfied: xmltodict in c:\users\padrao\anaconda3\lib\site-packages (from py3nvml>=0.2->watermark) (0.13.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\padrao\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=6.0->watermark) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\padrao\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=6.0->watermark) (0.2.5)

In [5]:
# Vers√µes dos pacotes usados neste jupyter notebook
%reload_ext watermark
%watermark -a "Alex Silva" --iversions

Author: Alex Silva

pandas: 1.5.3

In [1]:
import pandas as pd

# DataFrame

In [6]:
# Carregando o arquivo do disco e armazenando como um dataframe
df = pd.read_csv("dados/dataset1.csv")

In [7]:
# Tipo de objeto
type(df)

pandas.core.frame.DataFrame

In [8]:
# Atributo shape
df.shape

(615, 6)

In [9]:
# Atributo size(total de registros considerando cada coluna)
df.size

3690

In [10]:
# Metodo head()
df.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00

In [11]:
# Metodo taiil()
df.tail(10)

    club last_name first_name position  base_salary  guaranteed_compensation
605  VAN   Rosales      Mauro        M      65004.0                 65004.00
606  VAN    Seiler       Cole        D      54075.0                 54075.00
607  VAN      Shea       Brek      M-D     625000.0                670000.00
608  VAN    Tchani       Tony        M     275000.0                308333.33
609  VAN   Techera   Cristian        M     352000.0                377000.00
610  VAN   Teibert    Russell        M     126500.0                194000.00
611  VAN  Tornaghi      Paolo       GK      80000.0                 80000.00
612  VAN    Waston    Kendall        D     350000.0                368125.00
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                184000.00

In [12]:
# Metodo info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [14]:
# Metodo describe()
df.describe()

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [15]:
# Metodo describe()para uma coluna
df.club.describe()

count     614
unique     23
top       VAN
freq       32
Name: club, dtype: object

In [16]:
# Metodo value_counts()
df.value_counts()

club  last_name  first_name  position  base_salary  guaranteed_compensation
ATL   Almiron    Miguel      M         1912500.0    2297000.0                  1
ORL   Perez      Matias      F         260004.0     260004.0                   1
      Redding    Tommy       D         110000.0     117500.0                   1
      Rivas      Carlos      M         375000.0     375000.0                   1
      Rocha      Tony        M         65620.8      65620.8                    1
                                                                              ..
KC    Iwasa      Cameron     F         53004.0      53004.0                    1
      Juliao     Igor        D         100008.0     115008.0                   1
      Medranda   Jimmy       D         130008.0     130008.0                   1
      Melia      Tim         GK        165000.0     167500.0                   1
VAN   de Jong    Marcel      D-M       140000.0     140000.0                   1
Length: 600, dtype: int64

In [17]:
# Metodo value_counts() para cada tipo de dado
df.dtypes.value_counts()

object     4
float64    2
dtype: int64

In [19]:
# Metodo value_counts()para cada tipo de coluna
df.club.value_counts()

VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
DAL      29
SJ       29
NYCFC    28
HOU      28
NYRB     28
TOR      27
RSL      27
POR      27
MTL      27
CHI      27
MNUFC    27
LA       27
DC       27
KC       26
COL      26
SEA      25
NE       23
LAFC      2
Name: club, dtype: int64

In [20]:
# Extrai os dados de uma coluna
df.club

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

In [21]:
# Extraindo os dados de uma coluna com slicing
df['club']

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

In [22]:
df['club'].head(10)

0    ATL
1    ATL
2    ATL
3    ATL
4    ATL
5    ATL
6    ATL
7    ATL
8    ATL
9    ATL
Name: club, dtype: object

In [23]:
df['club'].dtypes

dtype('O')

In [24]:
# Tipo de dado numa coluna
type(df['club'])

pandas.core.series.Series

## Manipula√ß√£o no N√≠vel de Coluna e Refatora√ß√£o

In [26]:
df.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [27]:
display(df)

    club last_name first_name position  base_salary  guaranteed_compensation
0    ATL   Almiron     Miguel        M    1912500.0               2297000.00
1    ATL   Ambrose      Mikey        D      65625.0                 65625.00
2    ATL      Asad      Yamil        M     150000.0                150000.00
3    ATL     Bloom       Mark        D      99225.0                106573.89
4    ATL  Carleton     Andrew        F      65000.0                 77400.00
..   ...       ...        ...      ...          ...                      ...
610  VAN   Teibert    Russell        M     126500.0                194000.00
611  VAN  Tornaghi      Paolo       GK      80000.0                 80000.00
612  VAN    Waston    Kendall        D     350000.0                368125.00
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                184000.00

[615 rows x 6 columns]

In [30]:
# Extraindo dados e uma coluna
df['first_name']

0       Miguel
1        Mikey
2        Yamil
3         Mark
4       Andrew
        ...
610    Russell
611      Paolo
612    Kendall
613        NaN
614    Sheanon
Name: first_name, Length: 615, dtype: object

In [32]:
# Extraindo dados de 2 colunas - passar as colunas como uma lista 
df[['first_name', 'last_name']]

    first_name last_name
0       Miguel   Almiron
1        Mikey   Ambrose
2        Yamil      Asad
3         Mark     Bloom
4       Andrew  Carleton
..         ...       ...
610    Russell   Teibert
611      Paolo  Tornaghi
612    Kendall    Waston
613        NaN       NaN
614    Sheanon  Williams

[615 rows x 2 columns]

In [33]:
# Podemos usar metodos com o resultado do slicing
df[['first_name', 'last_name']].head()

  first_name last_name
0     Miguel   Almiron
1      Mikey   Ambrose
2      Yamil      Asad
3       Mark     Bloom
4     Andrew  Carleton

In [34]:
# Usando o metodo com o resultado do slicing
df[['base_salary', 'guaranteed_compensation']].describe()

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [35]:
# Filtrando os dados de 3 colunas
df[['first_name', 'base_salary', 'club']]

    first_name  base_salary club
0       Miguel    1912500.0  ATL
1        Mikey      65625.0  ATL
2        Yamil     150000.0  ATL
3         Mark      99225.0  ATL
4       Andrew      65000.0  ATL
..         ...          ...  ...
610    Russell     126500.0  VAN
611      Paolo      80000.0  VAN
612    Kendall     350000.0  VAN
613        NaN          NaN  NaN
614    Sheanon     175000.0  VAN

[615 rows x 3 columns]

>Refatora√ß√£o - reorganizando o codigo

In [36]:
# Criando uma vari√°vel com a lista de nomes de colunas
salarios_atletas = ['first_name', 'base_salary', 'club']

In [37]:
# Usando a variavel salarios_atletas para filtrar o dataframe
df[salarios_atletas]

    first_name  base_salary club
0       Miguel    1912500.0  ATL
1        Mikey      65625.0  ATL
2        Yamil     150000.0  ATL
3         Mark      99225.0  ATL
4       Andrew      65000.0  ATL
..         ...          ...  ...
610    Russell     126500.0  VAN
611      Paolo      80000.0  VAN
612    Kendall     350000.0  VAN
613        NaN          NaN  NaN
614    Sheanon     175000.0  VAN

[615 rows x 3 columns]

In [41]:
type(salarios_atletas)

list

In [42]:
# Usando metodos e atributos normalmente
df[salarios_atletas].shape

(615, 3)

In [43]:
df[salarios_atletas].tail()

    first_name  base_salary club
610    Russell     126500.0  VAN
611      Paolo      80000.0  VAN
612    Kendall     350000.0  VAN
613        NaN          NaN  NaN
614    Sheanon     175000.0  VAN

## Adi√ß√£o de Colunas e √çndices Com e Sem Broadcasting

#### Sem Broadcasting

In [44]:
df.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [45]:
# Adicionando nova coluna
df['salario_final'] = 0

In [46]:
df.head()

,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00,0
1,ATL,Ambrose,Mikey,D,65625.0,65625.00,0
2,ATL,Asad,Yamil,M,150000.0,150000.00,0
3,ATL,Bloom,Mark,D,99225.0,106573.89,0
4,ATL,Carleton,Andrew,F,65000.0,77400.00,0

In [47]:
# Preenchendo o valor da nova coluna a partir de outras variaveis
df['salario_final'] = df['base_salary'] + df['guaranteed_compensation']

In [48]:
df.head()

,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00,4209500.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00,131250.00
2,ATL,Asad,Yamil,M,150000.0,150000.00,300000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89,205798.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00,142400.00

In [49]:
# Adicionando nova coluna
df.insert(0, column = "ID", value = range(1, 1 + len(df)))

In [50]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912500.0,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65625.0,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150000.0,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99225.0,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65000.0,77400.00,142400.00

In [51]:
df.tail()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
610,611,VAN,Teibert,Russell,M,126500.0,194000.0,320500.0
611,612,VAN,Tornaghi,Paolo,GK,80000.0,80000.0,160000.0
612,613,VAN,Waston,Kendall,D,350000.0,368125.0,718125.0
613,614,NaN,NaN,NaN,NaN,NaN,NaN,NaN
614,615,VAN,Williams,Sheanon,D,175000.0,184000.0,359000.0

#### Com Brodcasting

In [52]:
# Esta instru√ß√£o n√£o altera o dataframe original
df["base_salary"].add(5)

0      1912505.0
1        65630.0
2       150005.0
3        99230.0
4        65005.0
         ...
610     126505.0
611      80005.0
612     350005.0
613          NaN
614     175005.0
Name: base_salary, Length: 615, dtype: float64

In [53]:
# Esta instru√ß√£o altera o dataframe original
df['base_salary'] = df["base_salary"].add(5)

In [54]:
df.base_salary.head()

0    1912505.0
1      65630.0
2     150005.0
3      99230.0
4      65005.0
Name: base_salary, dtype: float64

In [55]:
# Adicionando nova coluna usando Broadcasting (convertendo de USD para EURO, neste exemplo)
df["base_salary_eur"] = df["base_salary"].mul(0.92)

In [56]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final,base_salary_eur
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00,1759504.6
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00,60379.6
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00,138004.6
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89,91291.6
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00,59804.6

In [57]:
# Drop de coluna - deletar a coluna
df.drop(columns = ['base_salary_eur'], inplace = True)

In [58]:
df.head()

,ID,club,last_name,first_name,position,base_salary,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,77400.00,142400.00

In [59]:
# Adicionando nova coluna no indice 6
df.insert(6, column = "base_salary_eur", value = df["base_salary"].mul(0.92))

In [60]:
df.head()

,ID,club,last_name,first_name,position,base_salary,base_salary_eur,guaranteed_compensation,salario_final
0,1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00

In [62]:
# Renomeando as colunas
df.rename(columns = {"base_salary": "base_salary_usd", 
                     "guaranteed_compensation": "guaranteed_compensation_usd",
                     "salario_final": "salario_final_usd"},
         inplace = True)

In [63]:
df.head()

,ID,club,last_name,first_name,position,base_salary_usd,base_salary_eur,guaranteed_compensation_usd,salario_final_usd
0,1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
1,2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
2,3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
3,4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
4,5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00

In [64]:
# Convertendo a coluna ID em indece da tabela
df.set_index('ID', inplace = True)

In [65]:
df.head()

,club,last_name,first_name,position,base_salary_usd,base_salary_eur,guaranteed_compensation_usd,salario_final_usd
ID,,,,,,,,
1,ATL,Almiron,Miguel,M,1912505.0,1759504.6,2297000.00,4209500.00
2,ATL,Ambrose,Mikey,D,65630.0,60379.6,65625.00,131250.00
3,ATL,Asad,Yamil,M,150005.0,138004.6,150000.00,300000.00
4,ATL,Bloom,Mark,D,99230.0,91291.6,106573.89,205798.89
5,ATL,Carleton,Andrew,F,65005.0,59804.6,77400.00,142400.00

In [66]:
df.tail()

,club,last_name,first_name,position,base_salary_usd,base_salary_eur,guaranteed_compensation_usd,salario_final_usd
ID,,,,,,,,
611,VAN,Teibert,Russell,M,126505.0,116384.6,194000.0,320500.0
612,VAN,Tornaghi,Paolo,GK,80005.0,73604.6,80000.0,160000.0
613,VAN,Waston,Kendall,D,350005.0,322004.6,368125.0,718125.0
614,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
615,VAN,Williams,Sheanon,D,175005.0,161004.6,184000.0,359000.0

## Opera√ß√µes com Dataframes

### Parte 1

In [67]:
# Criando um dicion√°rio com pares de chave e valor
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                         index = ['Closing price', 'EPS',' Shares Outstanding(M)', 'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36], 
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)', 'Beta'])}

In [68]:
# Tipo do objeto
type(stock)

dict

In [69]:
# Visualizando
stock

{'AMZN': Closing price            346.15
 EPS                        0.59
 Shares Outstanding(M)    459.00
 Beta                       0.52
 P/E                      589.80
 Market Cap(B)            158.88
 dtype: float64,
 'GOOG': Closing price            1133.43
 EPS                        36.05
 Shares Outstanding(M)     335.83
 Beta                        0.87
 P/E                        31.44
 Market Cap(B)             380.64
 dtype: float64,
 'FB': Closing price               61.48
 EPS                          0.59
  Shares Outstanding(M)    2450.00
 P/E                        104.93
 Market Cap(B)              150.92
 dtype: float64,
 'YHOO': Closing price              34.90
 EPS                         1.27
 Shares Outstanding(M)    1010.00
 P/E                        27.48
 Beta                        0.66
 Market Cap(B)              35.36
 dtype: float64,
 'TWTR': Closing price             65.25
 EPS                       -0.30
 Shares Outstanding(M)    555.20
 Market Cap(B)             36.23
 dtype: float64,
 'AAPL': Closing price            501.53
 EPS                       40.32
 Shares Outstanding(M)    892.45
 P/E                       12.44
 Market Cap(B)            447.59
 Beta                       0.84
 dtype: float64}

In [70]:
# Convertendo o dicionario em dataframe do pands
stock_df = pd.DataFrame(stock)

In [71]:
stock_df.head(10)

                          AMZN     GOOG       FB     YHOO    TWTR    AAPL
 Shares Outstanding(M)     NaN      NaN  2450.00      NaN     NaN     NaN
Beta                      0.52     0.87      NaN     0.66     NaN    0.84
Closing price           346.15  1133.43    61.48    34.90   65.25  501.53
EPS                       0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)           158.88   380.64   150.92    35.36   36.23  447.59
P/E                     589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)   459.00   335.83      NaN  1010.00  555.20  892.45

In [72]:
# Podemos converter o dicion√°rio em dataframe definindo quais s√£o os √≠ndices de cada linha e a ordem desejada
stock_df = pd.DataFrame(stock, 
                        index = ['Closing price',
                                 'EPS', 
                                 'Shares Outstanding(M)',
                                 'P/E', 
                                 'Market Cap(B)',
                                 'Beta'])

In [75]:
stock_df.head(6)

                         AMZN     GOOG      FB     YHOO    TWTR    AAPL
Closing price          346.15  1133.43   61.48    34.90   65.25  501.53
EPS                      0.59    36.05    0.59     1.27   -0.30   40.32
Shares Outstanding(M)  459.00   335.83     NaN  1010.00  555.20  892.45
P/E                    589.80    31.44  104.93    27.48     NaN   12.44
Market Cap(B)          158.88   380.64  150.92    35.36   36.23  447.59
Beta                     0.52     0.87     NaN     0.66     NaN    0.84

In [78]:
# Podemos converter o dicion√°rio em dataframe definindo quais s√£o os √≠ndices de cada linha e os t√≠tulos das colunas
stock_df = pd.DataFrame(stock,
                        index = ['Closing price',
                                 'EPS',
                                 'Shares Outstanding(M)',
                                 'P/E', 
                                 'Market Cap(B)',
                                 'Beta'],
                        columns = ['AMZN','GOOG','FB'])

In [80]:
# √çndices
stock_df.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [81]:
# Colunas
stock_df.columns

Index(['AMZN', 'GOOG', 'FB'], dtype='object')

### Parte 2

In [82]:
# Dicion√°rio
Quadro_Medalhas_Olimpiada = {
    'EUA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Inglaterra':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Alemanha':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Uruguai':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [83]:
# Converte para dataframe
df_olimpiada = pd.DataFrame.from_dict(Quadro_Medalhas_Olimpiada)

In [84]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [85]:
display(df_olimpiada)

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [87]:
type(df_olimpiada)

pandas.core.frame.DataFrame

In [88]:
df_olimpiada.head()

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [89]:
df_olimpiada['China']

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [90]:
Medalhas_China = df_olimpiada['China']

In [91]:
type(Medalhas_China)

pandas.core.series.Series

In [92]:
Medalhas_China

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [94]:
df_olimpiada.Uruguai

Ouro      17
Prata     10
Bronze    15
Name: Uruguai, dtype: int64

In [95]:
df_olimpiada[['Alemanha', 'EUA']]

        Alemanha  EUA
Ouro          19   46
Prata         18   37
Bronze        19   38

In [96]:
df_olimpiada.get('Inglaterra')

Ouro      27
Prata     23
Bronze    17
Name: Inglaterra, dtype: int64

In [97]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

### Parte 3

In [98]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [117]:
df_olimpiada[:2]

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [100]:
df_olimpiada[2:]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [104]:
df_olimpiada[::2]

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Bronze   38     26          17        19       15

In [105]:
df_olimpiada[::-2]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15
Ouro     46     26          27        19       17

In [116]:
# Retornando coluna
df_olimpiada.iloc[::2, :4]

        EUA  China  Inglaterra  Alemanha
Ouro     46     26          27        19
Bronze   38     26          17        19

In [133]:
# Retornando coluna
df_olimpiada.iloc[::-2, ::-1]

        Uruguai  Alemanha  Inglaterra  China  EUA
Bronze       15        19          17     26   38
Ouro         17        19          27     26   46

In [135]:
# Fun√ß√£o loc = localizar
df_olimpiada.loc['Ouro']

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [136]:
df_olimpiada.loc[:,'EUA']

Ouro      46
Prata     37
Bronze    38
Name: EUA, dtype: int64

In [137]:
# Retornar o numero de medalhas de prata da China
df_olimpiada.loc['Prata','China']

18

In [138]:
df_olimpiada.loc['Prata']

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [139]:
# Utilizando opera√ß√µes logicas 
df_olimpiada.loc['Ouro'] > 20

EUA            True
China          True
Inglaterra     True
Alemanha      False
Uruguai       False
Name: Ouro, dtype: bool

In [140]:
# Retornando os numeros de medalhas de ouro maior que 20
df_olimpiada.loc['Ouro', df_olimpiada.loc['Ouro'] > 20]

EUA           46
China         26
Inglaterra    27
Name: Ouro, dtype: int64

In [143]:
# iloc(permite utilizar o numero do indice) para buscar a linha de √≠ndice 0
df_olimpiada.iloc[0]

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [144]:
# iloc para buscar a linha de √≠ndice 2
df_olimpiada.iloc[2]

EUA           38
China         26
Inglaterra    17
Alemanha      19
Uruguai       15
Name: Bronze, dtype: int64

In [145]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [146]:
df_olimpiada.iloc[:2]

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [147]:
# Linha indice 2 bronze, colunas de 0 a 2 sendo que o 2 √© exclusivo, ser√° excluido.
df_olimpiada.iloc[2,0:2]

EUA      38
China    26
Name: Bronze, dtype: int64

In [148]:
# Virgula com 2:3 antes da virgula significa linhas de indices 2 a 3 sendo o 3 exclusivo, e todas as colunas, resultado bronze de todos os paises
df_olimpiada.iloc[2:3, :]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [149]:
# Linha indice 1 todas as colunas
df_olimpiada.iloc[1,:]

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [150]:
df_olimpiada.iloc[2, 0]

38

> Podemos ainda deletar partes de um dataframe.

In [151]:
# Deletando uma coluna
del df_olimpiada['EUA']

In [152]:
df_olimpiada

        China  Inglaterra  Alemanha  Uruguai
Ouro       26          27        19       17
Prata      18          23        18       10
Bronze     26          17        19       15

> Bem como podemos inserir no dataframe.

In [153]:
# Inserindo nova coluna com tupla
df_olimpiada.insert(0, 'Brasil', (17, 16, 23))

In [154]:
df_olimpiada

        Brasil  China  Inglaterra  Alemanha  Uruguai
Ouro        17     26          27        19       17
Prata       16     18          23        18       10
Bronze      23     26          17        19       15

In [155]:
df_olimpiada.insert(0, 'Italia', (28, 35, 43))

In [156]:
df_olimpiada.insert(2, 'Jap√£o', (12, 11, 20))

In [157]:
df_olimpiada.insert(7, 'EUA', (32, 35, 40))

In [158]:
df_olimpiada.insert(5, 'Canada', (27, 39, 37))

In [159]:
df_olimpiada.insert(3, 'Fran√ßa', (29, 32, 34))

In [160]:
df_olimpiada

,Italia,Brasil,Jap√£o,Fran√ßa,China,Inglaterra,Canada,Alemanha,Uruguai,EUA
Ouro,28,17,12,29,26,27,27,19,17,32
Prata,35,16,11,32,18,23,39,18,10,35
Bronze,43,23,20,34,26,17,37,19,15,40

In [161]:
df_olimpiada.describe()

,Italia,Brasil,Jap√£o,Fran√ßa,China,Inglaterra,Canada,Alemanha,Uruguai,EUA
count,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000
mean,35.333333,18.666667,14.333333,31.666667,23.333333,22.333333,34.333333,18.666667,14.000000,35.666667
std,7.505553,3.785939,4.932883,2.516611,4.618802,5.033223,6.429101,0.577350,3.605551,4.041452
min,28.000000,16.000000,11.000000,29.000000,18.000000,17.000000,27.000000,18.000000,10.000000,32.000000
25%,31.500000,16.500000,11.500000,30.500000,22.000000,20.000000,32.000000,18.500000,12.500000,33.500000
50%,35.000000,17.000000,12.000000,32.000000,26.000000,23.000000,37.000000,19.000000,15.000000,35.000000
75%,39.000000,20.000000,16.000000,33.000000,26.000000,25.000000,38.000000,19.000000,16.000000,37.500000
max,43.000000,23.000000,20.000000,34.000000,26.000000,27.000000,39.000000,19.000000,17.000000,40.000000

## Opera√ß√µes com Series

In [2]:
import numpy as np

In [3]:
# Lista de listas (matriz)
matriz = [[9, 4, 3], [2, 6, 1], [7, 5, 8]]

In [5]:
matriz

[[9, 4, 3], [2, 6, 1], [7, 5, 8]]

In [4]:
# Convertendo a matriz em dataframe
df = pd.DataFrame(matriz)

In [6]:
# Tipo de objeto
type(df)

pandas.core.frame.DataFrame

In [7]:
# Extrai a linha de √≠ndice 0
linha = df.iloc[0, :]

In [8]:
type(linha)

pandas.core.series.Series

In [9]:
coluna = df[0]

In [10]:
type(coluna)

pandas.core.series.Series

In [11]:
# Criando uma serie
serie_pandas = pd.Series(['a', 'b','c', 'd', 'e'])

In [12]:
serie_pandas

0    a
1    b
2    c
3    d
4    e
dtype: object

In [13]:
# Visualizando os indices
serie_pandas.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
# Visualiza os valores
serie_pandas.values

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [15]:
# Visualiza o tipo dos dados
serie_pandas.dtypes

dtype('O')

In [16]:
# Visualiza o shape
serie_pandas.shape

(5,)

In [17]:
serie_pandas = pd.Series(['a', 'b', 'c', 10, True], index = [10, 20, 30, 40, 50])

In [18]:
serie_pandas.index

Int64Index([10, 20, 30, 40, 50], dtype='int64')

In [19]:
serie_pandas

10       a
20       b
30       c
40      10
50    True
dtype: object

In [20]:
serie_pandas = pd.Series(['a', 'b', 'c', 10, True])

In [21]:
serie1_pandas = pd.Series(['Genesis','Exodo','Levitico','Numeros','Deuteronomio'], index = [1, 2, 3, 4, 5])

In [22]:
serie1_pandas

1         Genesis
2           Exodo
3        Levitico
4         Numeros
5    Deuteronomio
dtype: object

In [23]:
dicionario = {'a': 'Palmeiras', 'b': 'Santos', 'c': 'Flamengo'}

In [24]:
serie_pandas = pd.Series(dicionario)

In [25]:
print(serie_pandas)

a    Palmeiras
b       Santos
c     Flamengo
dtype: object

In [26]:
lista = ['Python', 'Java', 'Rust']

In [27]:
serie_pandas = pd.Series(lista)

In [28]:
print(serie_pandas)

0    Python
1      Java
2      Rust
dtype: object

In [29]:
# Cria um array Numpy
arr = np.random.randint(0, 10, size = 5)

In [30]:
print(arr)

[1 5 8 3 8]

In [31]:
serie_pandas = pd.Series(arr)

In [32]:
print(serie_pandas)

0    1
1    5
2    8
3    3
4    8
dtype: int32

In [33]:
serie_pandas = pd.Series({1: 'data', 2: 'science'})

In [34]:
serie_pandas

1       data
2    science
dtype: object

In [35]:
print(serie_pandas[1])

data

In [37]:
serie_pandas = pd.Series([1, 2, 3, 4, 5])

In [38]:
print(serie_pandas)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [95]:
livro_escritores = pd.DataFrame({'Livro': ['Genesis'], 'Escritor':['Mois√©s']});print(livro_escritores)

     Livro Escritor
0  Genesis   Mois√©s

In [59]:
novos_livros = pd.DataFrame({'Livro': ['√äxodo', 'Lev√≠tico', 'N√∫meros', 'Deuteron√¥mio', 'Josu√©', 'Ju√≠zes', 'Rute', '1 Samuel', '2 Samuel', '1 Reis', '2 Reis', '1 Cr√¥nicas', '2 Cr√¥nicas', 'Esdras', 'Neemias', 'Ester'],
                            'Escritor': ['Mois√©s', 'Mois√©s', 'Mois√©s', 'Mois√©s', 'Josu√©', 'Samuel', 'Samuel', 'Samuel;Gade;Nat√£', 'Gade;Nat√£', 'Jeremias', 'Jeremias', 'Esdras','Esdras', 'Esdras', 'Neemias', 'Mordecai']})

print(novos_livros)

           Livro          Escritor
0          √äxodo            Mois√©s
1       Lev√≠tico            Mois√©s
2        N√∫meros            Mois√©s
3   Deuteron√¥mio            Mois√©s
4          Josu√©             Josu√©
5         Ju√≠zes            Samuel
6           Rute            Samuel
7       1 Samuel  Samuel;Gade;Nat√£
8       2 Samuel         Gade;Nat√£
9         1 Reis          Jeremias
10        2 Reis          Jeremias
11    1 Cr√¥nicas            Esdras
12    2 Cr√¥nicas            Esdras
13        Esdras            Esdras
14       Neemias           Neemias
15         Ester          Mordecai

In [60]:
# Concatenar DataFrames
biblia_escritores = pd.concat([livro_escritores, novos_livros], ignore_index=True)

print(biblia_escritores)

           Livro          Escritor
0        Genesis            Moises
1          √äxodo            Mois√©s
2       Lev√≠tico            Mois√©s
3        N√∫meros            Mois√©s
4   Deuteron√¥mio            Mois√©s
5          Josu√©             Josu√©
6         Ju√≠zes            Samuel
7           Rute            Samuel
8       1 Samuel  Samuel;Gade;Nat√£
9       2 Samuel         Gade;Nat√£
10        1 Reis          Jeremias
11        2 Reis          Jeremias
12    1 Cr√¥nicas            Esdras
13    2 Cr√¥nicas            Esdras
14        Esdras            Esdras
15       Neemias           Neemias
16         Ester          Mordecai

In [62]:
display(biblia_escritores)

           Livro          Escritor
0        Genesis            Moises
1          √äxodo            Mois√©s
2       Lev√≠tico            Mois√©s
3        N√∫meros            Mois√©s
4   Deuteron√¥mio            Mois√©s
5          Josu√©             Josu√©
6         Ju√≠zes            Samuel
7           Rute            Samuel
8       1 Samuel  Samuel;Gade;Nat√£
9       2 Samuel         Gade;Nat√£
10        1 Reis          Jeremias
11        2 Reis          Jeremias
12    1 Cr√¥nicas            Esdras
13    2 Cr√¥nicas            Esdras
14        Esdras            Esdras
15       Neemias           Neemias
16         Ester          Mordecai

In [63]:
novos_livros2 = pd.DataFrame({'Livro': ['J√≥', 'Salmos', 'Prov√©rbios', 'Eclesiastes', 'C√¢ntico_de_Salom√£o', 'Isa√≠as', 'Jeremias', 'Lamenta√ß√µes', 'Ezequiel', 'Daniel', 'Oseias', 'Joel', 'Am√≥s', 'Jonas', 'Miqueias', 'Naum', 'Habacuque','Sofonias', 'Ageu', 'Zacarias', 'Malaquias'],
                            'Escritor': ['Mois√©s', 'Davi;outros', 'Salom√£o;Agur;Lemuel', 'Salom√£o', 'Salom√£o', 'Isa√≠as', 'Jeremias', 'Jeremias', 'Ezequiel', 'Daniel', 'Oseias', 'Joel','Am√≥s', 'Jonas', 'Miqueias', 'Naum', 'Habacuque','Sofonias', 'Ageu','Zacarias', 'Malaquias']})

print(novos_livros2)

                 Livro             Escritor
0                   J√≥               Mois√©s
1               Salmos          Davi;outros
2           Prov√©rbios  Salom√£o;Agur;Lemuel
3          Eclesiastes              Salom√£o
4   C√¢ntico_de_Salom√£o              Salom√£o
5               Isa√≠as               Isa√≠as
6             Jeremias             Jeremias
7          Lamenta√ß√µes             Jeremias
8             Ezequiel             Ezequiel
9               Daniel               Daniel
10              Oseias               Oseias
11                Joel                 Joel
12                Am√≥s                 Am√≥s
13               Jonas                Jonas
14            Miqueias             Miqueias
15                Naum                 Naum
16           Habacuque            Habacuque
17            Sofonias             Sofonias
18                Ageu                 Ageu
19            Zacarias             Zacarias
20           Malaquias            Malaquias

In [65]:
# Concatenar DataFrames
biblia_escritores = pd.concat([livro_escritores, novos_livros, novos_livros2], ignore_index=True)

print(biblia_escritores)

                 Livro             Escritor
0              Genesis               Moises
1                √äxodo               Mois√©s
2             Lev√≠tico               Mois√©s
3              N√∫meros               Mois√©s
4         Deuteron√¥mio               Mois√©s
5                Josu√©                Josu√©
6               Ju√≠zes               Samuel
7                 Rute               Samuel
8             1 Samuel     Samuel;Gade;Nat√£
9             2 Samuel            Gade;Nat√£
10              1 Reis             Jeremias
11              2 Reis             Jeremias
12          1 Cr√¥nicas               Esdras
13          2 Cr√¥nicas               Esdras
14              Esdras               Esdras
15             Neemias              Neemias
16               Ester             Mordecai
17                  J√≥               Mois√©s
18              Salmos          Davi;outros
19          Prov√©rbios  Salom√£o;Agur;Lemuel
20         Eclesiastes              Salom√£o
21  C√¢ntico_de_Salom√£o              Salom√£o
22              Isa√≠as               Isa√≠as
23            Jeremias             Jeremias
24         Lamenta√ß√µes             Jeremias
25            Ezequiel             Ezequiel
26              Daniel               Daniel
27              Oseias               Oseias
28                Joel                 Joel
29                Am√≥s                 Am√≥s
30               Jonas                Jonas
31            Miqueias             Miqueias
32                Naum                 Naum
33           Habacuque            Habacuque
34            Sofonias             Sofonias
35                Ageu                 Ageu
36            Zacarias             Zacarias
37           Malaquias            Malaquias

In [66]:
novas_linhas = pd.DataFrame({'Livro': ['Obadias'], 'Escritor': ['Obadias']})

In [67]:
novas_linhas

     Livro Escritor
0  Obadias  Obadias

In [68]:
# Inserir as linhas no √≠ndice 30
biblia_escritores = pd.concat([biblia_escritores.iloc[:30], novas_linhas, biblia_escritores.iloc[30:]], ignore_index=True);print(biblia_escritores)

                 Livro             Escritor
0              Genesis               Moises
1                √äxodo               Mois√©s
2             Lev√≠tico               Mois√©s
3              N√∫meros               Mois√©s
4         Deuteron√¥mio               Mois√©s
5                Josu√©                Josu√©
6               Ju√≠zes               Samuel
7                 Rute               Samuel
8             1 Samuel     Samuel;Gade;Nat√£
9             2 Samuel            Gade;Nat√£
10              1 Reis             Jeremias
11              2 Reis             Jeremias
12          1 Cr√¥nicas               Esdras
13          2 Cr√¥nicas               Esdras
14              Esdras               Esdras
15             Neemias              Neemias
16               Ester             Mordecai
17                  J√≥               Mois√©s
18              Salmos          Davi;outros
19          Prov√©rbios  Salom√£o;Agur;Lemuel
20         Eclesiastes              Salom√£o
21  C√¢ntico_de_Salom√£o              Salom√£o
22              Isa√≠as               Isa√≠as
23            Jeremias             Jeremias
24         Lamenta√ß√µes             Jeremias
25            Ezequiel             Ezequiel
26              Daniel               Daniel
27              Oseias               Oseias
28                Joel                 Joel
29                Am√≥s                 Am√≥s
30             Obadias              Obadias
31               Jonas                Jonas
32            Miqueias             Miqueias
33                Naum                 Naum
34           Habacuque            Habacuque
35            Sofonias             Sofonias
36                Ageu                 Ageu
37            Zacarias             Zacarias
38           Malaquias            Malaquias

In [70]:
display(biblia_escritores)

                 Livro             Escritor
0              Genesis               Moises
1                √äxodo               Mois√©s
2             Lev√≠tico               Mois√©s
3              N√∫meros               Mois√©s
4         Deuteron√¥mio               Mois√©s
5                Josu√©                Josu√©
6               Ju√≠zes               Samuel
7                 Rute               Samuel
8             1 Samuel     Samuel;Gade;Nat√£
9             2 Samuel            Gade;Nat√£
10              1 Reis             Jeremias
11              2 Reis             Jeremias
12          1 Cr√¥nicas               Esdras
13          2 Cr√¥nicas               Esdras
14              Esdras               Esdras
15             Neemias              Neemias
16               Ester             Mordecai
17                  J√≥               Mois√©s
18              Salmos          Davi;outros
19          Prov√©rbios  Salom√£o;Agur;Lemuel
20         Eclesiastes              Salom√£o
21  C√¢ntico_de_Salom√£o              Salom√£o
22              Isa√≠as               Isa√≠as
23            Jeremias             Jeremias
24         Lamenta√ß√µes             Jeremias
25            Ezequiel             Ezequiel
26              Daniel               Daniel
27              Oseias               Oseias
28                Joel                 Joel
29                Am√≥s                 Am√≥s
30             Obadias              Obadias
31               Jonas                Jonas
32            Miqueias             Miqueias
33                Naum                 Naum
34           Habacuque            Habacuque
35            Sofonias             Sofonias
36                Ageu                 Ageu
37            Zacarias             Zacarias
38           Malaquias            Malaquias

In [71]:

print(serie_pandas)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [72]:
serie_pandas = pd.Series([1, 2, 3, 4, 5], dtype = 'float')

In [73]:
print(serie_pandas)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [75]:
serie_pandas = pd.Series(['Azul', 'Amarelo', 'Azul', 'Branco', 'Branco', 'Verde', 'Azul'])

In [76]:
print(serie_pandas.unique())

['Azul' 'Amarelo' 'Branco' 'Verde']

In [80]:
print(serie_pandas.nunique())

4

In [81]:
serie_pandas = pd.Series([201, 323, 17, 97, 43, 9, 26, 4])

In [82]:
# Retornar os maiores valores metodo nlargest
print(serie_pandas.nlargest(n = 3))

1    323
0    201
3     97
dtype: int64

In [83]:
# Retornar os menores valores metodo nsmallest
print(serie_pandas.nsmallest(n = 2))

7    4
5    9
dtype: int64

In [84]:
serie_pandas = pd.Series(['Azul', 'Amarelo', 'Azul', 'Branco', 'Branco', 'Verde', 'Azul'])

In [85]:
print(serie_pandas.value_counts())

Azul       3
Branco     2
Amarelo    1
Verde      1
dtype: int64

In [86]:
serie_pandas = pd.Series([1, 2, 3, np.nan, np.nan])

In [87]:
# Contagem dos valores NA
print(serie_pandas.isna().sum())

2

In [88]:
# Fazendo a contagem dos elementos desconsiderando o NA
print(serie_pandas.count())

3

In [89]:
serie_pandas = pd.Series([1, 2, 3, 4])

In [90]:
# Tem algum valor igual a 3?
print(serie_pandas.eq(3))

0    False
1    False
2     True
3    False
dtype: bool

In [91]:
# Tem valor maior que 2? gt == >
print(serie_pandas.gt(2))

0    False
1    False
2     True
3     True
dtype: bool

In [92]:
serie_pandas = pd.Series([56, 34, 68, 21, 49])

In [93]:
print(serie_pandas.mean())

45.6

In [94]:
# Agregando com metodo agg de agrega√ß√£o
print(serie_pandas.agg(['mean', 'median', 'sum', 'count']))

mean       45.6
median     49.0
sum       228.0
count       5.0
dtype: float64